doc/sprint2_writeup.org
#+TITLE: CS449 Sprint 2 Report
#+AUTHOR: Team \textbf{Misael's} Project Submission
#+SUBTITLE: Michael Cu, Elias Julian Marko Garcia, Samuel Lim
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{array}

* Micro Charter
  :PROPERTIES:
  :CUSTOM_ID: S1
  :END:   
** Project Name
   :PROPERTIES:
   :END:
   N Men Morris
** Vision Statement
   :PROPERTIES:
   :END:
   Create a extensible framework for board game web apps with scalability and performance.
** Mission Statement
   :PROPERTIES:
   :END:
   To play Nine Men's Morris on the web browser using a composable web technology stack that allows
   for future modularity while not foregoing performance.
** Elevator Pitch and Business Value
   :PROPERTIES:
   :END:
   We are creating Nine Men's Morris on a board game framework using Express.js and Neon for
   Rust. This allows for a data and type safe application that is capable of composability,
   scalability, extensibility, and performance.
** Customers and Users
   :PROPERTIES:
   :END:
   - Customers: Entrepreneurs and ventures that want to deploy board games on the web with low
     overhead, latency, and maintenance.
   - Users: Individuals who are passionate about board games and want a new online experience that
     they can take and play wherever they go with their friends.
** Metrics
   :PROPERTIES:
   :END:
   By benchmarking N Men Morris, we can compare our solution to other products on the market on:
   1. latency
   2. binary size
   3. up-time
** Milestones
   :PROPERTIES:
   :END:
   1. First MVP
   2. First Offline N Men's Morris
   3. Player versus Player (Offline)
   4. Player versus Player (Online)
** Risks
   :PROPERTIES:
   :END:
   1. Inherent complexity of technology stack.
   2. Inability to cooperate with teammates.
   3. Plausibility of orphaning project due to development team size.
** Authors
   :PROPERTIES:
   :END:
   - Michael Cu
   - Elias Julian Marko Garcia
   - Samuel Lim
* User Stories
  :PROPERTIES:
  :CUSTOM_ID: S2
  :END:

  Below you will find a table that makes up our "User Story Board", with some simplifications taken
  with respect to the total contents of the board. With respect to the final formal documentation,
  i.e. this paper, we only keep the basic qualitative and quantitative values for each story in the
  table while giving each user story proper its own section. This makes documenting each story
  less unruly while also easier to read. Each Story I.D. (SID) value is internally linked to its
  respective story, which also helps with navigating this section.
  
   #+ATTR_LaTeX: :align |c|m{3.5cm}|c|c|c|c|m{2.0cm}|
   |     |                        |          | Time Est. | Actual |        |                     |
   | SID | Story Name             | Priority |      (hr) | (hr)   | Status | Developer(s)        |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID1][S1]]  | Default Board Layout   | high     |        10 | 4      | DONE   | Sam, Michael, Elias |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID2][S2]]  | Mills Board            | high     |        10 | 4      | DONE   | Sam                 |
   |     | Coordinate System      |          |           |        |        |                     |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID3][S3]]  | Player Selection       | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID4][S4]]  | Piece Assignment       | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID5][S5]]  | Game Menu Prompt       | high     |        10 | 2      | TODO   | Sam, Michael        |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID6][S6]]  | Start Game Prompt      | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID7][S7]]  | Player Turn Assignment | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID8][S8]]  | Position Selection     | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID9][S9]]  | Position Placement     | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID10][S10]] | Position Movement      | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID11][S11]] | Elimination Movement   | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID12][S12]] | Mill Definition        | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID13][S13]] | Mill Attack Attribute  | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID14][S14]] | Mill Defense Attribute | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID15][S15]] | Mill Piece Movement    | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID16][S16]] | Elimination with Mills | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID17][S17]] | Flying Definition      | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID18][S18]] | Flying Piece Ability   | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID19][S19]] | End Game: Loss         | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID20][S20]] | End Game: Win          | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID21][S21]] | End Game: Tie          | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID22][S22]] | Reset Board            | medium   |        10 | -      | TODO   | -                   |
   |-----+------------------------+----------+-----------+--------+--------+---------------------|
   | [[#SID23][S23]] | Start New Game         | medium   |        10 | -      | TODO   | -                   |
   
** Default Board Layout
   :PROPERTIES:
   :CUSTOM_ID: SID1
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need a game board with 4 expanded squares, each with 8 equidistant positions, to
    play a game of Nine Men's Morris.
** Mills Board Coordinate System
   :PROPERTIES:
   :CUSTOM_ID: SID2
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need a way to navigate and read the board to play a game of Nine Men's Morris.
** Player Selection
   :PROPERTIES:
   :CUSTOM_ID: SID3
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    As a user, I want to choose a distinct color for my player.

** Piece Assignment
   :PROPERTIES:
   :CUSTOM_ID: SID4
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I want to receive 9 distinct pieces to place on the board.
** Game Menu Prompt
   :PROPERTIES:
   :CUSTOM_ID: SID5
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I am prompted with a GUI that shows the game board along with menu items.

** Start Game Prompt
   :PROPERTIES:
   :CUSTOM_ID: SID6
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need a GUI to prompt me with the options to start a game with either another human
    or against the computer.
