doc/sprint2_writeup.tex
% Created 2019-11-03 Sun 23:57
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{float}
\usepackage{array}
\author{Team \textbf{Misael's} Project Submission}
\date{\today}
\title{CS449 Sprint 2 Report\\\medskip
\large Michael Cu, Elias Julian Marko Garcia, Samuel Lim}
\hypersetup{
 pdfauthor={Team \textbf{Misael's} Project Submission},
 pdftitle={CS449 Sprint 2 Report},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Micro Charter}
\label{sec:orgd5d7a74}
\subsection{Project Name}
\label{sec:org9aacb67}
N Men Morris
\subsection{Vision Statement}
\label{sec:orga6fa6fc}
Create a extensible framework for board game web apps with scalability and performance.
\subsection{Mission Statement}
\label{sec:org420e3fc}
To play Nine Men's Morris on the web browser using a composable web technology stack that allows
for future modularity while not foregoing performance.
\subsection{Elevator Pitch and Business Value}
\label{sec:orgcfb234b}
We are creating Nine Men's Morris on a board game framework using Express.js and Neon for
Rust. This allows for a data and type safe application that is capable of composability,
scalability, extensibility, and performance.
\subsection{Customers and Users}
\label{sec:org4d5525e}
\begin{itemize}
\item Customers: Entrepreneurs and ventures that want to deploy board games on the web with low
overhead, latency, and maintenance.
\item Users: Individuals who are passionate about board games and want a new online experience that
they can take and play wherever they go with their friends.
\end{itemize}
\subsection{Metrics}
\label{sec:orga3004db}
By benchmarking N Men Morris, we can compare our solution to other products on the market on:
\begin{enumerate}
\item latency
\item binary size
\item up-time
\end{enumerate}
\subsection{Milestones}
\label{sec:org24c8aa6}
\begin{enumerate}
\item First MVP
\item First Offline N Men's Morris
\item Player versus Player (Offline)
\item Player versus Player (Online)
\end{enumerate}
\subsection{Risks}
\label{sec:orgb50d803}
\begin{enumerate}
\item Inherent complexity of technology stack.
\item Inability to cooperate with teammates.
\item Plausibility of orphaning project due to development team size.
\end{enumerate}
\subsection{Authors}
\label{sec:org6486e92}
\begin{itemize}
\item Michael Cu
\item Elias Julian Marko Garcia
\item Samuel Lim
\end{itemize}
\section{User Stories}
\label{sec:org088e600}
Below you will find a table that makes up our "User Story Board", with some simplifications taken
with respect to the total contents of the board. With respect to the final formal documentation,
i.e. this paper, we only keep the basic qualitative and quantitative values for each story in the
table while giving each user story proper its own section. This makes documenting each story
less unruly while also easier to read. Each Story I.D. (SID) value is internally linked to its
respective story, which also helps with navigating this section.

\begin{center}
\begin{tabular}{|c|m{3.5cm}|c|c|c|c|m{2.0cm}|}
 &  &  & Time Est. & Actual &  & \\
SID & Story Name & Priority & (hr) & (hr) & Status & Developer(s)\\
\hline
\hyperref[sec:org67174d3]{S1} & Default Board Layout & high & 10 & 4 & DONE & Sam, Michael, Elias\\
\hline
\hyperref[sec:org85871bb]{S2} & Mills Board & high & 10 & 4 & DONE & Sam\\
 & Coordinate System &  &  &  &  & \\
\hline
\hyperref[sec:org6661b71]{S3} & Player Selection & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org47fb86d]{S4} & Piece Assignment & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgdbe2eb7]{S5} & Game Menu Prompt & high & 10 & 2 & TODO & Sam, Michael\\
\hline
\hyperref[sec:org43c0251]{S6} & Start Game Prompt & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgf5d0825]{S7} & Player Turn Assignment & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org32a9c34]{S8} & Position Selection & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org5998e16]{S9} & Position Placement & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org63225c5]{S10} & Position Movement & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgff878c8]{S11} & Elimination Movement & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org270309e]{S12} & Mill Definition & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgd93b3e8]{S13} & Mill Attack Attribute & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgb433984]{S14} & Mill Defense Attribute & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgb40c89e]{S15} & Mill Piece Movement & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org87e067c]{S16} & Elimination with Mills & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org5b846fb]{S17} & Flying Definition & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orga0b430b]{S18} & Flying Piece Ability & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org85c3e8e]{S19} & End Game: Loss & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgd2e7630]{S20} & End Game: Win & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org68c3d56]{S21} & End Game: Tie & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:org9362e46]{S22} & Reset Board & medium & 10 & - & TODO & -\\
\hline
\hyperref[sec:orgcd7d7fe]{S23} & Start New Game & medium & 10 & - & TODO & -\\
\end{tabular}
\end{center}

\subsection{Default Board Layout}
\label{sec:org67174d3}
\subsubsection*{Description}
\label{sec:orgbd243a0}
As a user, I need a game board with 4 expanded squares, each with 8 equidistant positions, to
play a game of Nine Men's Morris.
\subsection{Mills Board Coordinate System}
\label{sec:org85871bb}
\subsubsection*{Description}
\label{sec:orgf86356f}
As a user, I need a way to navigate and read the board to play a game of Nine Men's Morris.
\subsection{Player Selection}
\label{sec:org6661b71}
\subsubsection*{Description}
\label{sec:org65d9368}
As a user, I want to choose a distinct color for my player.

\subsection{Piece Assignment}
\label{sec:org47fb86d}
\subsubsection*{Description}
\label{sec:orgbfe18f7}
As a user, I want to receive 9 distinct pieces to place on the board.
\subsection{Game Menu Prompt}
\label{sec:orgdbe2eb7}
\subsubsection*{Description}
\label{sec:org22e85b9}
As a user, I am prompted with a GUI that shows the game board along with menu items.

\subsection{Start Game Prompt}
\label{sec:org43c0251}
\subsubsection*{Description}
\label{sec:org6a74a30}
As a user, I need a GUI to prompt me with the options to start a game with either another human
or against the computer.
