doc/sprint2_writeup.org
** Player Turn Assignment
   :PROPERTIES:
   :CUSTOM_ID: SID7
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I want to receive either the first or second player's move at the beginning of the game.
** Position Selection
   :PROPERTIES:
   :CUSTOM_ID: SID8
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need to be able to select an empty position to choose it for piece placement.

** Position Placement
   :PROPERTIES:
   :CUSTOM_ID: SID9
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need to be able to place a piece on an empty position to finish my turn.

** Position Movement
   :PROPERTIES:
   :CUSTOM_ID: SID10
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I want to be able to move my pieces to unoccupied positions.

** Elimination Movement
   :PROPERTIES:
   :CUSTOM_ID: SID11
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    
    As a user, I want to be able to move my pieces into enemy positions should I qualify.

** Mill Definition
   :PROPERTIES:
   :CUSTOM_ID: SID12
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need the game to recognize when three of my pieces are placed in adjacent positions in order to form a mill.

** Mill Attack Attribute
   :PROPERTIES:
   :CUSTOM_ID: SID13
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:

    As a user, I need the ability to eliminate an enemy piece to attack as a player.

** Mill Defense Attribute
   :PROPERTIES:
   :CUSTOM_ID: SID14
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need pieces within a recognized mill to be immune from elimination to defend as a
    player.

** Mill Piece Movement
   :PROPERTIES:
   :CUSTOM_ID: SID15
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I want to move pieces that make up mills into any position not occupied by one of my
    other pieces.

** Elimination With Mills
   :PROPERTIES:
   :CUSTOM_ID: SID16
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I want my pieces to remove opponent pieces from the board individually.

** Flying Definition
   :PROPERTIES:
   :CUSTOM_ID: SID17
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need the game to recognize when I have less than 4 pieces to gain the ability to
    "fly" my pieces.

** Flying Piece Ability
   :PROPERTIES:
   :CUSTOM_ID: SID18
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I need the ability to move a piece to any empty position on the map when I only have
    3 pieces to fly.
    
** End Game: Loss
   :PROPERTIES:
   :CUSTOM_ID: SID19
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, the game must recognize when I reach less than 3 pieces to declare me a loser.
    
** End Game: Win
   :PROPERTIES:
   :CUSTOM_ID: SID20
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, the game must recognize when my opponent reaches less than 3 pieces to declare me the
    winner.

** End Game: Tie
   :PROPERTIES:
   :CUSTOM_ID: SID21
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, the game must recognize when the board state has repeated the same layout N times
    after a player has reached less than 4 players in order to declare the game a tie ("Remis").

** Reset Board
   :PROPERTIES:
   :CUSTOM_ID: SID22
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I want to be able to restart a game with a new, empty board.
    
** Start New Game
   :PROPERTIES:
   :CUSTOM_ID: SID23
   :END:
*** Description
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    As a user, I want to be able to start a new game with the default configuration as before I started the game.
    
* Acceptance Criteria
  :PROPERTIES:
  :CUSTOM_ID: S3
  :END:

  The following section covers the acceptance criteria enumerated in response to the User Stories
  discovered and documented in [[#S2][$\S{2}$]]. In a similar fashion to $\S{2}$, the table documenting these
  acceptance criteria is in a simplified form. Every Acceptance Criterion has an Acceptance
  Criterion ID (=ACID=), which is associated in the table below with its respective =SID=, development
  status, and the developers responsible for implementing it. Each =ACID= is linked to its respective
  subsection below for viewing the description of each criterion.

   #+ATTR_LaTeX: :align |l|c|c|c|
   | SID & Name                 | ACID | Status | Developer(s)        |
   |----------------------------+------+--------+---------------------|
   | [[#SID1][S1]] Default Board Layout    | [[#ACID1][A1]]   | DONE   | Sam, Elias, Michael |
   |----------------------------+------+--------+---------------------|
   | [[#SID2][S2]] Mills Board Coordinate  | [[#ACID2][A2]]   | DONE   | Sam, Elias, Michael |
   | $\hspace{0.4cm}$ System    |      |        |                     |
   |----------------------------+------+--------+---------------------|
   | [[#SID3][S3]] Player Selection        | [[#ACID3][A3]]   | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID4][S4]] Piece Assignment        | [[#ACID4][A4]]   | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID5][S5]] Game Menu Prompt        | [[#ACID5][A5]]   | DONE   | Sam, Michael        |
   |----------------------------+------+--------+---------------------|
   | [[#SID6][S6]] Start Game Prompt       | [[#ACID6][A6]]   | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID7][S7]] Player Turn Assignment  | [[#ACID7][A7]]   | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID8][S8]] Position Selection      | [[#ACID8][A8]]   | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID9][S9]] Position Placement      | [[#ACID9][A9]]   | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID10][S10]] Position Movement      | [[#ACID10][A10]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID11][S11]] Elimination Movement   | [[#ACID11][A11]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID12][S12]] Mill Definition        | [[#ACID12][A12]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID13][S13]] Mill Attack Attribute  | [[#ACID13][A13]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID14][S14]] Mill Defense Attribute | [[#ACID14][A14]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID15][S15]] Mill Piece Movement    | [[#ACID15][A15]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID16][S16]] Elimination with Mills | [[#ACID16][A16]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID17][S17]] Flying Definition      | [[#ACID17][A17]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID18][S18]] Flying Piece Ability   | [[#ACID18][A18]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID19][S19]] End Game: Loss         | [[#ACID19][A19]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID20][S20]] End Game: Win          | [[#ACID20][A20]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID21][S21]] End Game: Tie          | [[#ACID21][A21]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID22][S22]] Reset Board            | [[#ACID22][A22]]  | TODO   | -                   |
   |----------------------------+------+--------+---------------------|
   | [[#SID23][S23]] Start New Game         | [[#ACID23][A23]]  | TODO   | -                   |
   
