doc/sprint2_writeup.tex
\subsection{Player Turn Assignment}
\label{sec:orgf5d0825}
\subsubsection*{Description}
\label{sec:org69f5335}
As a user, I want to receive either the first or second player's move at the beginning of the game.
\subsection{Position Selection}
\label{sec:org32a9c34}
\subsubsection*{Description}
\label{sec:org3577541}
As a user, I need to be able to select an empty position to choose it for piece placement.

\subsection{Position Placement}
\label{sec:org5998e16}
\subsubsection*{Description}
\label{sec:org63bccb8}
As a user, I need to be able to place a piece on an empty position to finish my turn.

\subsection{Position Movement}
\label{sec:org63225c5}
\subsubsection*{Description}
\label{sec:org6b2c4ff}
As a user, I want to be able to move my pieces to unoccupied positions.

\subsection{Elimination Movement}
\label{sec:orgff878c8}
\subsubsection*{Description}
\label{sec:org13d3fa2}
As a user, I want to be able to move my pieces into enemy positions should I qualify.

\subsection{Mill Definition}
\label{sec:org270309e}
\subsubsection*{Description}
\label{sec:orgfd066dd}
As a user, I need the game to recognize when three of my pieces are placed in adjacent positions in order to form a mill.

\subsection{Mill Attack Attribute}
\label{sec:orgd93b3e8}
\subsubsection*{Description}
\label{sec:org6b36497}
As a user, I need the ability to eliminate an enemy piece to attack as a player.

\subsection{Mill Defense Attribute}
\label{sec:orgb433984}
\subsubsection*{Description}
\label{sec:org95d2755}
As a user, I need pieces within a recognized mill to be immune from elimination to defend as a
player.

\subsection{Mill Piece Movement}
\label{sec:orgb40c89e}
\subsubsection*{Description}
\label{sec:orgc5fcc39}
As a user, I want to move pieces that make up mills into any position not occupied by one of my
other pieces.

\subsection{Elimination With Mills}
\label{sec:org87e067c}
\subsubsection*{Description}
\label{sec:orgdd347f4}
As a user, I want my pieces to remove opponent pieces from the board individually.

\subsection{Flying Definition}
\label{sec:org5b846fb}
\subsubsection*{Description}
\label{sec:orgc06013f}
As a user, I need the game to recognize when I have less than 4 pieces to gain the ability to
"fly" my pieces.

\subsection{Flying Piece Ability}
\label{sec:orga0b430b}
\subsubsection*{Description}
\label{sec:orgf3aab8a}
As a user, I need the ability to move a piece to any empty position on the map when I only have
3 pieces to fly.

\subsection{End Game: Loss}
\label{sec:org85c3e8e}
\subsubsection*{Description}
\label{sec:orgf0d1fe2}
As a user, the game must recognize when I reach less than 3 pieces to declare me a loser.

\subsection{End Game: Win}
\label{sec:orgd2e7630}
\subsubsection*{Description}
\label{sec:org2d93bc5}
As a user, the game must recognize when my opponent reaches less than 3 pieces to declare me the
winner.

\subsection{End Game: Tie}
\label{sec:org68c3d56}
\subsubsection*{Description}
\label{sec:org5c8460d}
As a user, the game must recognize when the board state has repeated the same layout N times
after a player has reached less than 4 players in order to declare the game a tie ("Remis").

\subsection{Reset Board}
\label{sec:org9362e46}
\subsubsection*{Description}
\label{sec:org03b19c8}
As a user, I want to be able to restart a game with a new, empty board.

\subsection{Start New Game}
\label{sec:orgcd7d7fe}
\subsubsection*{Description}
\label{sec:org1235138}
As a user, I want to be able to start a new game with the default configuration as before I started the game.

\section{Acceptance Criteria}
\label{sec:org8d016a3}
The following section covers the acceptance criteria enumerated in response to the User Stories
discovered and documented in \hyperref[sec:org088e600]{\(\S{2}\)}. In a similar fashion to \(\S{2}\), the table documenting these
acceptance criteria is in a simplified form. Every Acceptance Criterion has an Acceptance
Criterion ID (\texttt{ACID}), which is associated in the table below with its respective \texttt{SID}, development
status, and the developers responsible for implementing it. Each \texttt{ACID} is linked to its respective
subsection below for viewing the description of each criterion.

\begin{center}
\begin{tabular}{|l|c|c|c|}
SID \& Name & ACID & Status & Developer(s)\\
\hline
\hyperref[sec:org67174d3]{S1} Default Board Layout & \hyperref[sec:orgd2db761]{A1} & DONE & Sam, Elias, Michael\\
\hline
\hyperref[sec:org85871bb]{S2} Mills Board Coordinate & \hyperref[sec:orgf5fa540]{A2} & DONE & Sam, Elias, Michael\\
\(\hspace{0.4cm}\) System &  &  & \\
\hline
\hyperref[sec:org6661b71]{S3} Player Selection & \hyperref[sec:orgeafb96c]{A3} & TODO & -\\
\hline
\hyperref[sec:org47fb86d]{S4} Piece Assignment & \hyperref[sec:org421b2d5]{A4} & TODO & -\\
\hline
\hyperref[sec:orgdbe2eb7]{S5} Game Menu Prompt & \hyperref[sec:org7397a1b]{A5} & DONE & Sam, Michael\\
\hline
\hyperref[sec:org43c0251]{S6} Start Game Prompt & \hyperref[sec:org1ee5f94]{A6} & TODO & -\\
\hline
\hyperref[sec:orgf5d0825]{S7} Player Turn Assignment & \hyperref[sec:org6347978]{A7} & TODO & -\\
\hline
\hyperref[sec:org32a9c34]{S8} Position Selection & \hyperref[sec:org7a2a0ef]{A8} & TODO & -\\
\hline
\hyperref[sec:org5998e16]{S9} Position Placement & \hyperref[sec:orgd4d8544]{A9} & TODO & -\\
\hline
\hyperref[sec:org63225c5]{S10} Position Movement & \hyperref[sec:org8c4c34f]{A10} & TODO & -\\
\hline
\hyperref[sec:orgff878c8]{S11} Elimination Movement & \hyperref[sec:orgc3de5a9]{A11} & TODO & -\\
\hline
\hyperref[sec:org270309e]{S12} Mill Definition & \hyperref[sec:orgda13f39]{A12} & TODO & -\\
\hline
\hyperref[sec:orgd93b3e8]{S13} Mill Attack Attribute & \hyperref[sec:orgd506595]{A13} & TODO & -\\
\hline
\hyperref[sec:orgb433984]{S14} Mill Defense Attribute & \hyperref[sec:org202e2aa]{A14} & TODO & -\\
\hline
\hyperref[sec:orgb40c89e]{S15} Mill Piece Movement & \hyperref[sec:orga7e794a]{A15} & TODO & -\\
\hline
\hyperref[sec:org87e067c]{S16} Elimination with Mills & \hyperref[sec:orgd880bd7]{A16} & TODO & -\\
\hline
\hyperref[sec:org5b846fb]{S17} Flying Definition & \hyperref[sec:orgfa5b7aa]{A17} & TODO & -\\
\hline
\hyperref[sec:orga0b430b]{S18} Flying Piece Ability & \hyperref[sec:org11dcfea]{A18} & TODO & -\\
\hline
\hyperref[sec:org85c3e8e]{S19} End Game: Loss & \hyperref[sec:org082f487]{A19} & TODO & -\\
\hline
\hyperref[sec:orgd2e7630]{S20} End Game: Win & \hyperref[sec:orga61a44b]{A20} & TODO & -\\
\hline
\hyperref[sec:org68c3d56]{S21} End Game: Tie & \hyperref[sec:org03f8b0c]{A21} & TODO & -\\
\hline
\hyperref[sec:org9362e46]{S22} Reset Board & \hyperref[sec:org2ff9ce5]{A22} & TODO & -\\
\hline
\hyperref[sec:orgcd7d7fe]{S23} Start New Game & \hyperref[sec:orge7b1e14]{A23} & TODO & -\\
\end{tabular}
\end{center}
