doc/sprint2_writeup.org
** Criterion 1
   :PROPERTIES:
   :CUSTOM_ID: ACID1
   :END:
    #+ATTR_LaTeX: :align |c|p{12.0cm}|
    |      | <71>                                                                    |
    | ACID | Description                                                             |
    |------+-------------------------------------------------------------------------|
    |  1.0 | Given a User...                                                         |
    |------+-------------------------------------------------------------------------|
    |  1.1 | When the board appears, it will render the default layout for Nine Men's Morris |
    |      |                                                                         |
    |  1.2 | When the User does not visit our site (IP), the board will not appear.  |

** Criterion 2
   :PROPERTIES:
   :CUSTOM_ID: ACID2
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  2.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   |  2.1 | When the board is rendered, it will include a coordinate system along the axis. |
   |      |                                                                         |
   |  2.2 | When the board is not rendered, there will be no coordinate system.     |

** Criterion 3
   :PROPERTIES:
   :CUSTOM_ID: ACID3
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  3.0 | Given a user...                                                         |
   |------+-------------------------------------------------------------------------|
   |  3.1 | When a user chooses one of two colors, then their player pieces will    |
   |      | be the chosen color.                                                    |
   |      |                                                                         |
   |  3.2 | When a user chooses one of the two colors, and it is already taken,     |
   |      | then they will not be the chosen color.                                 |
   |      |                                                                         |
   |  3.3 | When a user does not choose one of the two colors, then they will not   |
   |      | be assigned a color.                                                    |

** Criterion 4
   :PROPERTIES:
   :CUSTOM_ID: ACID4
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  4.0 | Given a user...                                                         |
   |------+-------------------------------------------------------------------------|
   |  4.1 | When users chooses one of two players, then the users will be assigned  |
   |      | N pieces of their color.                                                |
   |      |                                                                         |
   |  4.2 | When a user does not choose one of the two players, then the user will  |
   |      | not be assigned N pieces of their color.                                |

** Criterion 5
   :PROPERTIES:
   :CUSTOM_ID: ACID5
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  5.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   |  5.1 | When the website is loaded, it will show the game along with a menu buttons. |
   |      |                                                                         |
   |  5.2 | When the website is not loaded, it will not show the game or the game menu system.. |

** Criterion 6
   :PROPERTIES:
   :CUSTOM_ID: ACID6
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  6.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   |  6.1 | When the menu options are rendered, there is a button that displays start game. |
   |      |                                                                         |
   |  6.2 | When the menu options are not rendered, it will not show a button to start the game. |

** Criterion 7
   :PROPERTIES:
   :CUSTOM_ID: ACID7
   :END:
  
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  7.0 | Given a user...                                                         |
   |------+-------------------------------------------------------------------------|
   |  7.1 | When a user chooses which turn to play, then a user will recieve the    |
   |      | corresponding turn.                                                     |
   |      |                                                                         |
   |  7.2 | When a user does not choose a turn to play, then a user will not        |
   |      | receive the corresponding turn.                                         |
   
** Criterion 8
   :PROPERTIES:
   :CUSTOM_ID: ACID8
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  8.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   |  8.1 | When it is my turn, I can click on a empty board position.              |
   |      |                                                                         |
   |  8.2 | When it is not my turn, I cannot click on an empty board position.      |
   
** Criterion 9
   :PROPERTIES:
   :CUSTOM_ID: ACID9
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   |  9.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   |  9.1 | When it is my turn, I can place a piece on an empty position I have selected. |
   |      |                                                                         |
   |  9.2 | When it is not my turn, I cannot place a piece on an empty position.    |

** Criterion 10
   :PROPERTIES:
   :CUSTOM_ID: ACID10
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 10.0 | Given a user...                                                         |
   |------+-------------------------------------------------------------------------|
   | 10.1 | When a user moves a piece to an unoccupied position, then the user's    |
   |      | piece assumes the new position.                                         |
   |      |                                                                         |
   | 10.2 | When a user moves a piece to an occupied position of their own, then    |
   |      | the user's piece is not moved to the new position.                      |

** Criterion 11
   :PROPERTIES:
   :CUSTOM_ID: ACID11
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 11.0 | Given a user...                                                         |
   |------+-------------------------------------------------------------------------|
   | 11.1 | When a user moves their piece into an enemy position, then the user's   |
   |      | move will not qualify.                                                  |

** Criterion 12
   :PROPERTIES:
   :CUSTOM_ID: ACID12
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 12.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 12.1 | When I place three pieces adjacent to each other, the game recognizes   |
   |      | it as a mill.                                                           |
   |      |                                                                         |
   | 12.2 | When I do not place a piece that forms three adjacent occupied          |
   |      | positions, it is not recognized as a mill.                              |
