doc/sprint2_writeup.tex

\subsection{Criterion 1}
\label{sec:orgd2db761}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
1.0 & Given a User\ldots{}\\
\hline
1.1 & When the board appears, it will render the default layout for Nine Men's Morris\\
 & \\
1.2 & When the User does not visit our site (IP), the board will not appear.\\
\end{tabular}
\end{center}

\subsection{Criterion 2}
\label{sec:orgf5fa540}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
2.0 & Given a User\ldots{}\\
\hline
2.1 & When the board is rendered, it will include a coordinate system along the axis.\\
 & \\
2.2 & When the board is not rendered, there will be no coordinate system.\\
\end{tabular}
\end{center}

\subsection{Criterion 3}
\label{sec:orgeafb96c}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
3.0 & Given a user\ldots{}\\
\hline
3.1 & When a user chooses one of two colors, then their player pieces will\\
 & be the chosen color.\\
 & \\
3.2 & When a user chooses one of the two colors, and it is already taken,\\
 & then they will not be the chosen color.\\
 & \\
3.3 & When a user does not choose one of the two colors, then they will not\\
 & be assigned a color.\\
\end{tabular}
\end{center}

\subsection{Criterion 4}
\label{sec:org421b2d5}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
4.0 & Given a user\ldots{}\\
\hline
4.1 & When users chooses one of two players, then the users will be assigned\\
 & N pieces of their color.\\
 & \\
4.2 & When a user does not choose one of the two players, then the user will\\
 & not be assigned N pieces of their color.\\
\end{tabular}
\end{center}

\subsection{Criterion 5}
\label{sec:org7397a1b}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
5.0 & Given a User\ldots{}\\
\hline
5.1 & When the website is loaded, it will show the game along with a menu buttons.\\
 & \\
5.2 & When the website is not loaded, it will not show the game or the game menu system..\\
\end{tabular}
\end{center}

\subsection{Criterion 6}
\label{sec:org1ee5f94}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
6.0 & Given a User\ldots{}\\
\hline
6.1 & When the menu options are rendered, there is a button that displays start game.\\
 & \\
6.2 & When the menu options are not rendered, it will not show a button to start the game.\\
\end{tabular}
\end{center}

\subsection{Criterion 7}
\label{sec:org6347978}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
7.0 & Given a user\ldots{}\\
\hline
7.1 & When a user chooses which turn to play, then a user will recieve the\\
 & corresponding turn.\\
 & \\
7.2 & When a user does not choose a turn to play, then a user will not\\
 & receive the corresponding turn.\\
\end{tabular}
\end{center}

\subsection{Criterion 8}
\label{sec:org7a2a0ef}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
8.0 & Given a User\ldots{}\\
\hline
8.1 & When it is my turn, I can click on a empty board position.\\
 & \\
8.2 & When it is not my turn, I cannot click on an empty board position.\\
\end{tabular}
\end{center}

\subsection{Criterion 9}
\label{sec:orgd4d8544}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
9.0 & Given a User\ldots{}\\
\hline
9.1 & When it is my turn, I can place a piece on an empty position I have selected.\\
 & \\
9.2 & When it is not my turn, I cannot place a piece on an empty position.\\
\end{tabular}
\end{center}

\subsection{Criterion 10}
\label{sec:org8c4c34f}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
10.0 & Given a user\ldots{}\\
\hline
10.1 & When a user moves a piece to an unoccupied position, then the user's\\
 & piece assumes the new position.\\
 & \\
10.2 & When a user moves a piece to an occupied position of their own, then\\
 & the user's piece is not moved to the new position.\\
\end{tabular}
\end{center}

\subsection{Criterion 11}
\label{sec:orgc3de5a9}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
11.0 & Given a user\ldots{}\\
\hline
11.1 & When a user moves their piece into an enemy position, then the user's\\
 & move will not qualify.\\
\end{tabular}
\end{center}

\subsection{Criterion 12}
\label{sec:orgda13f39}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
12.0 & Given a User\ldots{}\\
\hline
12.1 & When I place three pieces adjacent to each other, the game recognizes\\
 & it as a mill.\\
 & \\
12.2 & When I do not place a piece that forms three adjacent occupied\\
 & positions, it is not recognized as a mill.\\
\end{tabular}
\end{center}
