doc/sprint2_writeup.org
** Criterion 13
   :PROPERTIES:
   :CUSTOM_ID: ACID13
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 13.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 13.1 | When it is my turn, and I have a mill formed, then I have the ability   |
   |      | to eliminate an opponent's piece.                                       |
   |      |                                                                         |
   | 13.2 | When it is my turn, and I do not have a mill formed, then I do not      |
   |      | have the ability to attack.                                             |
   |      |                                                                         |
   | 13.3 | When it is not my turn, and I have a mill formed, then I do not have    |
   |      | the ability to attack.                                                  |
   |      |                                                                         |
   | 13.4 | When it is not my turn, and I do not have a mill formed, then I do      |
   |      | not have the ability to attack.                                         |
** Criterion 14
   :PROPERTIES:
   :CUSTOM_ID: ACID14
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 14.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 14.1 | When it is my turn, and I have a mill formed, then the pieces in my     |
   |      | mill are defended from elimination.                                     |
   |      |                                                                         |
   | 14.2 | When it is my turn, and I do not have a mill formed, then my pieces     |
   |      | are not defended from elimination.                                      |
   |      |                                                                         |
   | 14.3 | When it is not my turn, and I have a mill formed, then the pieces       |
   |      | in my mill are defended from elimination.                               |
   |      |                                                                         |
   | 14.4 | When it is not my turn, and I do not have a mill formed, then my pieces |
   |      | are not defended from elimination.                                      |
** Criterion 15
   :PROPERTIES:
   :CUSTOM_ID: ACID15
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 15.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 15.1 | When a user selects a piece in a mill to move to an open position, then |
   |      | the piece will be moved to that new position outside of the mill        |
   |      |                                                                         |
   | 15.2 | When a user selects a piece in a mill to move to an invalid position,   |
   |      | then the piece will not be moved.                                       |
   |      |                                                                         |

** Criterion 16
   :PROPERTIES:
   :CUSTOM_ID: ACID16
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 16.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 16.1 | When a user removes opponent pieces from the board, then the opponent's |
   |      | piece will no longer appear on the board.                               |
   |      |                                                                         |
   | 16.2 | When a user removes their own piece from the board, then the piece will |
   |      | not be removed from the board.                                          |

** Criterion 17
   :PROPERTIES:
   :CUSTOM_ID: ACID17
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 17.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 17.1 | When it is my turn, and I only have three pieces, then I gain the       |
   |      | ability to "fly" across the board.                                      |
   |      |                                                                         |
   | 17.2 | When it is my turn, and I have more than three pieces, then I do not    |
   |      | gain the ability to "fly" across the board.                             |
   |      |                                                                         |
   | 17.3 | When it is not my turn, and I only have three pieces, then I do not     |
   |      | gain the ability to "fly" across the board.                             |
   |      |                                                                         |
   | 17.4 | When it is not my turn, and I have more than three pieces, then I do    |
   |      | not gain the ability to "fly" across the board.                         |
** Criterion 18
   :PROPERTIES:
   :CUSTOM_ID: ACID18
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 18.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 18.1 | When it is my turn, and I only have three pieces, then I can "fly"      |
   |      | a piece I own to any open position on the board.                        |
   |      |                                                                         |
   | 18.2 | When it is my turn, and I have more than three pieces, then I can't     |
   |      | "fly" a piece I own to any open position.                               |
   |      |                                                                         |
   | 18.3 | When it is not my turn, and I only have three pieces, then I can't      |
   |      | "fly" my piece across the board.                                        |
   |      |                                                                         |
   | 18.4 | When it is not my turn, and I have more than three pieces, then I can't |
   |      | "fly" my piece across the board.                                        |

** Criterion 19
   :PROPERTIES:
   :CUSTOM_ID: ACID19
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 19.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 19.1 | When I am reduced to less than three pieces, the game must declare me   |
   |      | the loser and end the game.                                             |
   |      |                                                                         |
   | 19.2 | When I am not reduced to less than three pieces, then the game does not |
   |      | declare me the loser nor end the game.                                  |

** Criterion 20
   :PROPERTIES:
   :CUSTOM_ID: ACID20
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 20.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 20.1 | When I reduce my opponent to less than three pieces, the game must      |
   |      | declare me the winner and end the game.                                 |
   |      |                                                                         |
   | 20.2 | When I do not reduced my opponent to less than three pieces, then the   |
   |      | game does not declare me the winner nor end the game.                   |
