doc/sprint2_writeup.tex
\subsection{Criterion 13}
\label{sec:orgd506595}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
13.0 & Given a User\ldots{}\\
\hline
13.1 & When it is my turn, and I have a mill formed, then I have the ability\\
 & to eliminate an opponent's piece.\\
 & \\
13.2 & When it is my turn, and I do not have a mill formed, then I do not\\
 & have the ability to attack.\\
 & \\
13.3 & When it is not my turn, and I have a mill formed, then I do not have\\
 & the ability to attack.\\
 & \\
13.4 & When it is not my turn, and I do not have a mill formed, then I do\\
 & not have the ability to attack.\\
\end{tabular}
\end{center}
\subsection{Criterion 14}
\label{sec:org202e2aa}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
14.0 & Given a User\ldots{}\\
\hline
14.1 & When it is my turn, and I have a mill formed, then the pieces in my\\
 & mill are defended from elimination.\\
 & \\
14.2 & When it is my turn, and I do not have a mill formed, then my pieces\\
 & are not defended from elimination.\\
 & \\
14.3 & When it is not my turn, and I have a mill formed, then the pieces\\
 & in my mill are defended from elimination.\\
 & \\
14.4 & When it is not my turn, and I do not have a mill formed, then my pieces\\
 & are not defended from elimination.\\
\end{tabular}
\end{center}
\subsection{Criterion 15}
\label{sec:orga7e794a}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
15.0 & Given a User\ldots{}\\
\hline
15.1 & When a user selects a piece in a mill to move to an open position, then\\
 & the piece will be moved to that new position outside of the mill\\
 & \\
15.2 & When a user selects a piece in a mill to move to an invalid position,\\
 & then the piece will not be moved.\\
 & \\
\end{tabular}
\end{center}

\subsection{Criterion 16}
\label{sec:orgd880bd7}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
16.0 & Given a User\ldots{}\\
\hline
16.1 & When a user removes opponent pieces from the board, then the opponent's\\
 & piece will no longer appear on the board.\\
 & \\
16.2 & When a user removes their own piece from the board, then the piece will\\
 & not be removed from the board.\\
\end{tabular}
\end{center}

\subsection{Criterion 17}
\label{sec:orgfa5b7aa}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
17.0 & Given a User\ldots{}\\
\hline
17.1 & When it is my turn, and I only have three pieces, then I gain the\\
 & ability to "fly" across the board.\\
 & \\
17.2 & When it is my turn, and I have more than three pieces, then I do not\\
 & gain the ability to "fly" across the board.\\
 & \\
17.3 & When it is not my turn, and I only have three pieces, then I do not\\
 & gain the ability to "fly" across the board.\\
 & \\
17.4 & When it is not my turn, and I have more than three pieces, then I do\\
 & not gain the ability to "fly" across the board.\\
\end{tabular}
\end{center}
\subsection{Criterion 18}
\label{sec:org11dcfea}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
18.0 & Given a User\ldots{}\\
\hline
18.1 & When it is my turn, and I only have three pieces, then I can "fly"\\
 & a piece I own to any open position on the board.\\
 & \\
18.2 & When it is my turn, and I have more than three pieces, then I can't\\
 & "fly" a piece I own to any open position.\\
 & \\
18.3 & When it is not my turn, and I only have three pieces, then I can't\\
 & "fly" my piece across the board.\\
 & \\
18.4 & When it is not my turn, and I have more than three pieces, then I can't\\
 & "fly" my piece across the board.\\
\end{tabular}
\end{center}

\subsection{Criterion 19}
\label{sec:org082f487}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
19.0 & Given a User\ldots{}\\
\hline
19.1 & When I am reduced to less than three pieces, the game must declare me\\
 & the loser and end the game.\\
 & \\
19.2 & When I am not reduced to less than three pieces, then the game does not\\
 & declare me the loser nor end the game.\\
\end{tabular}
\end{center}

\subsection{Criterion 20}
\label{sec:orga61a44b}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
20.0 & Given a User\ldots{}\\
\hline
20.1 & When I reduce my opponent to less than three pieces, the game must\\
 & declare me the winner and end the game.\\
 & \\
20.2 & When I do not reduced my opponent to less than three pieces, then the\\
 & game does not declare me the winner nor end the game.\\
\end{tabular}
\end{center}
