doc/sprint2_writeup.org
** Criterion 21
   :PROPERTIES:
   :CUSTOM_ID: ACID21
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 21.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 21.1 | When neither my opponent and I are reduced to less than three pieces    |
   |      | and we repeat the same board arrangement more than N times, then the    |
   |      | game is declared a "Remi", e.g. a tie, and the game is ended.           |
   |      |                                                                         |
   | 21.2 | When neither my opponent and I are reduced to less than three pieces    |
   |      | and we do not repeat the same board arrangement more than N times,      |
   |      | then the game is not declared "Remi" and is not ended.                  |

** Criterion 22
   :PROPERTIES:
   :CUSTOM_ID: ACID22
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 22.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 22.1 | When a user restarts the game, then the board will restart with an      |
   |      | empty board.                                                            |
   |      |                                                                         |
   |      |                                                                         |
   | 22.2 | When a user does not restart the game, then the board will retain the   |
   |      | current layout it contains.                                             |

** Criterion 23
   :PROPERTIES:
   :CUSTOM_ID: ACID23
   :END:
   #+ATTR_LaTeX: :align |c|p{12.0cm}|
   |      | <71>                                                                    |
   | ACID | Description                                                             |
   |------+-------------------------------------------------------------------------|
   | 22.0 | Given a User...                                                         |
   |------+-------------------------------------------------------------------------|
   | 22.1 | When a user starts a new game, then a user's default configuration will |
   |      | be used when a new game is started.                                     |
   |      |                                                                         |
   |      |                                                                         |
   | 22.2 | When a user does not start a new game, then the configuration will      |
   |      | remain unchanged.                                                       |

   \newpage
* Code Review
  :PROPERTIES:
  :CUSTOM_ID: S4
  :END:
