doc/sprint2_writeup.tex
\subsection{Criterion 21}
\label{sec:org03f8b0c}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
21.0 & Given a User\ldots{}\\
\hline
21.1 & When neither my opponent and I are reduced to less than three pieces\\
 & and we repeat the same board arrangement more than N times, then the\\
 & game is declared a "Remi", e.g. a tie, and the game is ended.\\
 & \\
21.2 & When neither my opponent and I are reduced to less than three pieces\\
 & and we do not repeat the same board arrangement more than N times,\\
 & then the game is not declared "Remi" and is not ended.\\
\end{tabular}
\end{center}

\subsection{Criterion 22}
\label{sec:org2ff9ce5}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
22.0 & Given a User\ldots{}\\
\hline
22.1 & When a user restarts the game, then the board will restart with an\\
 & empty board.\\
 & \\
 & \\
22.2 & When a user does not restart the game, then the board will retain the\\
 & current layout it contains.\\
\end{tabular}
\end{center}

\subsection{Criterion 23}
\label{sec:orge7b1e14}
\begin{center}
\begin{tabular}{|c|p{12.0cm}|}
ACID & Description\\
\hline
22.0 & Given a User\ldots{}\\
\hline
22.1 & When a user starts a new game, then a user's default configuration will\\
 & be used when a new game is started.\\
 & \\
 & \\
22.2 & When a user does not start a new game, then the configuration will\\
 & remain unchanged.\\
\end{tabular}
\end{center}

\newpage
