doc/sprint2_writeup.tex
\section{Code Review}
\label{sec:orgb808e2e}
\subsection{Checklist}
\label{sec:orgd556cee}
\begin{longtable}{|m{2.0cm}|m{3.0cm}|m{8.0cm}|}
 &  & \\
Checklist & Item & Findings\\
\hline
\endfirsthead
\multicolumn{3}{l}{Continued from previous page} \\

Checklist & Item & Findings \\

\hline
\endhead
\hline\multicolumn{3}{r}{Continued on next page} \\
\endfoot
\endlastfoot
\hline
Coding Standards &  & \\
\hline
 & Naming \newline Conventions & All naming conventions link directly to their use case and structs have compact naming systems relating to their purpose or game identity. This relates heavily to game component system design patter, i.e. ECS\\
\hline
 & Argument \newline ordering & Rust's formal parameter argument ordering is strict, i.e. the order of arguments cannot vary between calls for the same method. For JavaScript equivalent, same restrictions apply due to conversion.\\
\hline
 & Comments & Commenting could be improved by adding clarity in areas that handle pattern matching on handling of board inputs and conversions. No verbose comments and existing comments are well placed.\\
\hline
 & Code Style & Rustc comes with a component called Rustfmt that automatically formats code upon save to keep a consistent style across the codebase inline with Rust code formatting standards. Javascript is compliant with ES6 Lint.\\
\hline
 & Indentation & See above for answer. Both handled by linters provided.\\
\hline
Design Principles &  & \\
\hline
 & Abstraction \newline and Interfaces & Due to ECS, each component has high cohesion and loose coupling natively. Each entity as defined in the rust module is single purpose, and is incrementally composed from smaller entities defined for the game. Js mimics this, with abstraction mostly occurring in the module. Browser interactions make for event based components.\\
\hline
 & Proper \newline Encapsulation & JS x Rust interop makes for high modularity within types and their methods. Only that which is necessary to be exposed publicly is exposed as such, and FFI wrappings enforce a minimally exposed API to the server for handling game logic.\\
\hline
 & Command Query \newline Separation Principal & JS calls to rust module's methods, which in turn have a minimal API exposed through Manager. Manager, in turn, only have mutators or accessors for its private GameState object. These call to GameState itself through basic getters and setters.\\
\hline
 & Design by \newline Contract & The strict typing over the possible game states representable allow for exhaustive matching over the game variants. The JS poll's input objects are strict to their parameters passed to Rust.\\
\hline
 & Reasonable pre and post conditions & Yes. The typing models the domain space so we can keep track of pre/post conditions at an abstract level.\\
\hline
 & Open Closed Principal & JS can directly inherit class models from Rust, extending their functionality while not disturbing native code and implementation logic. This allows for modification of input logic while the game logic remains consistent and unaffected by irrelevant mutation.\\
\hline
 & Single Responsibility Principal & Due to our usage of the ECS design model/pattern, our classes, structure, and types, both in JS and Rust, are highly cohesive yet maintain individual responsibility for their logic.\\
\hline
Code Smells &  & \\
\hline
 & Magic Numbers & None.\\
\hline
 & Unnecessary Globals/Class vars & None.\\
\hline
 & Duplicate Code & Due to the nature of entity component systems (ECS), which our program uses as a design pattern for the game, there are no instance of duplication, only interactions with types.\\
\hline
 & Long Methods & None.\\
\hline
 & Long parameter list & None, due to ECS.\\
\hline
 & Over-complex expression & None.\\
\hline
 & Unnecessary Branching & None, where branching occurs through match statements, it is exhaustive of the game state without being enumerable.\\
\hline
 & Bad method/variable naming & None, see Coding Standards: Naming Conventions.\\
\hline
 & Similar methods in other classes & None, due to ECS.\\
\hline
\end{longtable}
