doc/sprint2_writeup.tex
\subsubsection{Manual Test 7}
\label{sec:org2c6ba93}
\lstset{language=js,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
document.getElementsByClass("turn-button")
[...].includes(pieceElement)
Choose the turn order
\end{lstlisting}
\subsubsection{Manual Test 8}
\label{sec:org76246c2}
\lstset{language=js,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
document.getElementById('E4')
(setupFullBoard() && move('E4', 'F4')) && document.getElementById('F4').style.backgroundColor === 'blue'
\end{lstlisting}
\subsubsection{Manual Test 8}
\label{sec:orgdfb2713}
\lstset{language=js,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
document.getElementById('E4')
(setupFullBoard() && formMill('red') && move('E4', 'F4')) && document.getElementById('F4').style.backgroundColor === 'red'
\end{lstlisting}

\subsubsection{Manual Test 9}
\label{sec:orgf6b4157}

\subsection{Other Manual Test Code}
\label{sec:org43855c3}

There were no other manual tests for this sprint.

\begin{center}
\begin{tabular}{|c|c|c|c|c|c|c|}
 &  &  &  &  &  & \\
 &  & Expected & Class & Method Name &  & \\
ID & Test Input & Result & Name & of Test & Status & Developer\\
\hline
 &  &  &  &  &  & \\
\end{tabular}
\end{center}

\section{Meeting Minutes}
\label{sec:org7ff693b}
\subsection{Meeting 2019.09.04}
\label{sec:orga9125f6}
\begin{itemize}
\item Duration: 1 Hour
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org7ca0c95}
\begin{itemize}
\item going over project pdf as group
\begin{itemize}
\item discussing tech stack
\item going over sprint assignments
\item going over normal assignments
\end{itemize}
\item discussing the actual structure of sprint 1
\begin{itemize}
\item requirements
\item user stories
\item what submission might look like
\item discussion of who gets to do what
\item discussion of when to meet, general availability
\begin{itemize}
\item Sam will be gone from 9th through 19th
\item Elias will be gone through the 12th - 14th
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection*{project 1 report}
\label{sec:org801685e}
\begin{itemize}
\item want to get scrum documentation done
\item get general idea down by end of this friday (2019.09.06)
\begin{itemize}
\item structure of the project
\item how to use the frameworks/libraries involved (personal research/reading
per individual)
\begin{itemize}
\item Neon for rust
\item node.js
\item potentially express.js
\end{itemize}
\end{itemize}
\item generating cards, user stories
\end{itemize}
\subsection{Meeting 2019.09.06}
\label{sec:orgd60cf45}
\begin{itemize}
\item Duration: 1 Hour
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:orga827735}
\begin{itemize}
\item discussing game rules
\item discussing/writing user stories
\item discussing tooling
\item discussing design
\end{itemize}
\subsubsection*{Game Rules}
\label{sec:org590420d}
\begin{itemize}
\item watched a video demo'ing the game
\item discussed/clarify mechanics
\begin{itemize}
\item whether or not to include coin flip
\item terms of loss
\item flying mechanic
\end{itemize}
\end{itemize}
\subsubsection*{User stories}
\label{sec:orgeb51b65}
\begin{itemize}
\item elias wrote user stories in a new org mode file called kanban.org on the
repository
\item discussed problem of documentation given requirements from the pdf for
sprint 1
\item discussed alternative means of documenting, carrying out execution of our
cards for the project
\end{itemize}
\subsubsection*{Tooling \& Design}
\label{sec:org2fea4a6}
\begin{itemize}
\item did not achieve agenda, did not get to these topics because of the time
it took to discuss our epics/user stories.
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org2f8ddcd}
\begin{itemize}
\item[{$\square$}] discuss tooling
\begin{itemize}
\item need to finalize what our stack will look like and frameworks to be
used.
\item elias has experimented with Neon and reports that it works well, seems
viable for the product.
\end{itemize}
\item[{$\square$}] discuss design
\begin{itemize}
\item need to discuss how the actual product will be packaged and its
architecture.
\end{itemize}
\end{itemize}
\subsection{Meeting 2019.09.27}
\label{sec:orgb85f8e8}
\begin{itemize}
\item Duration: 1 Hour, 30 minutes
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org4716552}
\begin{itemize}
\item discuss project structure
\item acceptance criteria
\item work assignment
\item remaining TODOs
\end{itemize}
\subsubsection*{Project Structure}
\label{sec:org017cad8}
\begin{itemize}
\item express.js has a lot of dependencies, only really need connect.js
\begin{itemize}
\item might try just using connect.js, which would be a lot simpler
\item will continue with using Neon
\end{itemize}
\item board
\begin{itemize}
\item gui
\begin{itemize}
\item js renders the fontend
\item logic/data is all handled on back
\end{itemize}
\item data structure/representation
\begin{itemize}
\item two choices:
\begin{enumerate}
\item one big board object that includes methods for both resolving where players are \textbf{and}
where things like mills are
\item two object entities, one is purely for the GUI (tracking positions on the board), the
other would be some kind of graph structure that allows position nodes to check peers
for occupation and whether it is the same or opposing players
\end{enumerate}
\end{itemize}
\item movement and move validity
\begin{itemize}
\item need to track flying
\begin{itemize}
\item proposition: flying is a universal property, merely constrained until player count is
reduced.
\begin{itemize}
\item need some kind of getter/setter between board and entity management system
\end{itemize}
\item mill detection
\begin{itemize}
\item if going with entity system, would merely be a graph traversal from any given node
\item another idea: create a mill entity system that tracks active mills and checks each
mill upon each turn(?) and modifies or destroys the mill as necessary.
\begin{itemize}
\item could save a lot of checking
\item as for organization/logical membership, would keep such a mill entity system
independent of other objects in the system for simplicity, at least for now.
\end{itemize}
\end{itemize}
\item Checking for attack
\begin{itemize}
\item if a mill entity system is used, we natively have a means to detect valid attacks. so
long as the node is not in one of the mills, do not attack \textbf{unless} all available
nodes are in mills.
\end{itemize}
\end{itemize}
\end{itemize}
\item game driver
\begin{itemize}
\item Will have some kind of Game entity/manager object that drives the game event loop.
\begin{itemize}
\item will take inputs from players, run them as game moves
\begin{itemize}
\item however, internal logic to the entity management system is what will ultimately validate moves
\item game manager will have no logic for why this happens, only passes back and for game
inputs and the results of moves.
\end{itemize}
\item consequentially, need to codify where and how game validation logic happens
\end{itemize}
\end{itemize}
\item validation logic
\begin{itemize}
\item as of now, think it will be handled by the main entity management system
\item will have a set of logic checking methods defined over the system that verify whether a
given move is allowed
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection*{Acceptance Criteria}
\label{sec:orgf254cee}
\begin{itemize}
\item realized we need to add numbering to the board GUI (a-g, 1-7)
\item (deferred, Sam will begin working on before next meeting)
\end{itemize}
\subsubsection*{Work Assignment}
\label{sec:org390a171}
\begin{itemize}
\item elias will begin on exploratory work for the backend (board, entity management, etc)
\item sam, michael will begin exploratory work for the frontend (GUI, communicating with backend)
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org33164a1}
\begin{itemize}
\item[{$\square$}] kanban board setup, finalization of workflow for documentation
\begin{itemize}
\item can probably just use github for real time management, but keep organizational and notes in
\texttt{kanban.org} file on the repo.
\end{itemize}
\item[{$\square$}] defining test cases for stories and acceptance criteria
\item[{$\square$}] refining stories
\begin{itemize}
\item same case applies with above: refine stories, and put them on github's project management
board accordingly; actual refinement can be delegated to within \texttt{kanban.org} file.
\end{itemize}
\end{itemize}
\subsection{Meeting 2019.10.02}
\label{sec:org69ba46a}
\begin{itemize}
\item Duration: 1 Hour, 40 Minutes
\item Location: Miller Nichols Library
\end{itemize}
