doc/sprint2_writeup.org
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - addressing tagged issues generated on GitHub
    - settling on how front-end talks to back-end
    - documentation/design stuff
*** Issues on GitHub
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
**** issue #3: determine communication channel between js and rust
     - event polling seems overkill for what we need
     - even handler on front-end which speaks to an entity ManagerGlue, which will be the JS that
       talks to rust backend
       + There will be a manager in the back-end, which will generate game state, and return that to
         the front-end
       + back-end will also have triggers (flags? Enums?) which signal to front-end when certain
         actions are no longer needed or valid, i.e. button inputs or game state continuation
     - JSON seems like a good enough medium for message passing between front and back components
***** issue #4 is largely tagged to #3, so this resolves that
      - =State=: Input Handle + BoardStruct + Trigger)
      - =BoardState=
        + this is what gets sent back to the JS
        + 1D array of the =State= struct
          - this array will be handed off as a NeonJS object, whatever it's called in neon
          - 
**** issue #6: Front-end/GUI Skeleton, Basic Design
     1. Neon builds a node module
     2. This is sent to express.js
        - accepts it as a bunch of js functions
     3. Express takes this, as a bunch of objects, and then saves as strings to JS files, in turn
        statically served to end user (i.e. browser)
        - express.js interaction is a one-off affair
     4. Stretch goal: being able to set different themes on the front-end
**** issue #8: CI/CD
     - GitHub has native CI/CD now via it's Action's service.
     - can impl for both Rust and Node.js
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - [ ] Design docs(?)
      + at least 3 needed:
        1) event diagram
        2) general UML diagram for total project
        3) class hierarchy/component diagram
** Meeting 2019.10.03
   - Discord: 1 Hour, 53 Minutes
   - Location: Video Call
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - how to branch
     - branching basic_gui
     - GitHub PR format
     - styling format
*** GitHub PR format
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - Show Michael how to create a branch
     - name the branch and pull from remote
     - push the branch from local
     - sync branches
     - checkout a branch
*** Branching =basic_gui=
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - created a branch =basic_gui=
     - set up an issue with the branch for PR
     - push a commit from local to remote branch
*** GitHub PR format
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - went through how to form a PR from different branches
     - how to further commit to the compare branch
*** Styling Format
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - no bootstrap, no jquery
     - setup proper layouts for the GUI
     - discussed how we want to handle events onclick
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - push scaffolds for the website GUI
     - handle basic logic for pushing items to back-end storage
     - create mock of Rust functionality in TypeScript for further discussion
** Meeting 2019.10.05
   - Duration: 1 Hour, 16 Minutes
   - Location: Video Call
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - CSS Grid
     - SASS
     - TypeScript
     - build script compilation and runtime
     - proper layout for GUI
*** CSS Grid
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - teach Michael about CSS Grid
     - pure CSS, not bootstrap (Elias)
     - use columns properly
     - no need for floats / flexbox
*** SASS
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - transpiler for CSS
     - allows nested functionality
     - separate compiled/uncompiled folders
     - use =watch= script to sync changes
*** TypeScript
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - better able to handle equivalence mocking to Rust
     - easy to push onto browser
     - separate folders (see above)
     - push to public folder for site access
*** Build Script Compilation and Runtime
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - use watch and start scripts to build site
     - separate scripts will be run for Rust beforehand
     - build scripts allow for synced changes between folders (see above)
*** Proper Layout for GUI
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - use column areas in CSS Grid
     - main column for game
     - nested grid for board layout (tentative)
     - proportion text for board side-by-side
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - design docs
     - microcharter
     - mocking TS => Rust
     - event keys on front-end (browser)
** Meeting 2019.10.06
   - Duration: 7 hours
   - Location: Video Call
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Tying up loose ends with respect to documentation and write up
    - Tying up loose ends with respect to UI/JS end of the application
    - Discussing what is left to do with the project
*** Documentation and Write-up
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Figured out how to format the tables given that many of the ones provided do not play well
      with latex/org-mode markdown
    - Similarly, decided on how to interconnect documentation components between sections
    - Discussed the remaining things left undocumented, particularly pair ratings.
*** UI/JS Loose Ends
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Complete manual testing of interacting elements
    - Finalize positions of clickable elements on the board grid.
    - Alternating player logic for placement of pieces.
    - Limiting piece placement to nine.
*** Discussing Future Sprint/Direction of Project
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Current User Stories are pseudo-Epics and need to be refined into better User stories aside
      from [[#SID1][S1]]. As they stand, discussing the current user stories makes for overly generic/abstract
      discussion and doesn't meaningfully translate into logic/behavior to implement and actual
      engineering tasks.
    - Currently, the front end mocks all of the behavior/functionality that would otherwise be
      provided by the backend. In sprint 2, this is where the real meat of programming will come in
      as we learn to make the back-end and front-end interface, particularly with translating data
      types across the FFI boundary through Neon.
    - We need to improve the current state documentation massively.
      + Design diagrams.
      + Docstrings across software code base.
      + Event diagrams.
    - Translate the above issues into their proper documentation for the master documentation and
      write-up file
    - How to test more of the functionality given that a major component of this application is
      running directly on the browser.
** Meeting 2019.10.11
   - Duration: 2 hour
   - Location: Miller Nichols Library
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - review sprint 1
      + bugs
    - roadmap sprint 2
      + outline what is needed
      + setup project board
      + issues
      + interface between front/end
