doc/sprint2_writeup.tex
\subsubsection*{Agenda}
\label{sec:org52da78e}
\begin{itemize}
\item addressing tagged issues generated on GitHub
\item settling on how front-end talks to back-end
\item documentation/design stuff
\end{itemize}
\subsubsection*{Issues on GitHub}
\label{sec:orgcd6d217}
\begin{itemize}
\item issue \#3: determine communication channel between js and rust
\label{sec:org55b2512}
\begin{itemize}
\item event polling seems overkill for what we need
\item even handler on front-end which speaks to an entity ManagerGlue, which will be the JS that
talks to rust backend
\begin{itemize}
\item There will be a manager in the back-end, which will generate game state, and return that to
the front-end
\item back-end will also have triggers (flags? Enums?) which signal to front-end when certain
actions are no longer needed or valid, i.e. button inputs or game state continuation
\end{itemize}
\item JSON seems like a good enough medium for message passing between front and back components
\end{itemize}
\begin{itemize}
\item issue \#4 is largely tagged to \#3, so this resolves that
\label{sec:org74a4f41}
\begin{itemize}
\item \texttt{State}: Input Handle + BoardStruct + Trigger)
\item \texttt{BoardState}
\begin{itemize}
\item this is what gets sent back to the JS
\item 1D array of the \texttt{State} struct
\begin{itemize}
\item this array will be handed off as a NeonJS object, whatever it's called in neon
\item 
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}
\item issue \#6: Front-end/GUI Skeleton, Basic Design
\label{sec:org39ddf14}
\begin{enumerate}
\item Neon builds a node module
\item This is sent to express.js
\begin{itemize}
\item accepts it as a bunch of js functions
\end{itemize}
\item Express takes this, as a bunch of objects, and then saves as strings to JS files, in turn
statically served to end user (i.e. browser)
\begin{itemize}
\item express.js interaction is a one-off affair
\end{itemize}
\item Stretch goal: being able to set different themes on the front-end
\end{enumerate}
\item issue \#8: CI/CD
\label{sec:org79eef76}
\begin{itemize}
\item GitHub has native CI/CD now via it's Action's service.
\item can impl for both Rust and Node.js
\end{itemize}
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org502537d}
\begin{itemize}
\item[{$\square$}] Design docs(?)
\begin{itemize}
\item at least 3 needed:
\begin{enumerate}
\item event diagram
\item general UML diagram for total project
\item class hierarchy/component diagram
\end{enumerate}
\end{itemize}
\end{itemize}
\subsection{Meeting 2019.10.03}
\label{sec:orgea980d4}
\begin{itemize}
\item Discord: 1 Hour, 53 Minutes
\item Location: Video Call
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org31830e2}
\begin{itemize}
\item how to branch
\item branching basic\(_{\text{gui}}\)
\item GitHub PR format
\item styling format
\end{itemize}
\subsubsection*{GitHub PR format}
\label{sec:org7eee53c}
\begin{itemize}
\item Show Michael how to create a branch
\item name the branch and pull from remote
\item push the branch from local
\item sync branches
\item checkout a branch
\end{itemize}
\subsubsection*{Branching \texttt{basic\_gui}}
\label{sec:org6ffebe3}
\begin{itemize}
\item created a branch \texttt{basic\_gui}
\item set up an issue with the branch for PR
\item push a commit from local to remote branch
\end{itemize}
\subsubsection*{GitHub PR format}
\label{sec:orgd4111f4}
\begin{itemize}
\item went through how to form a PR from different branches
\item how to further commit to the compare branch
\end{itemize}
\subsubsection*{Styling Format}
\label{sec:org629d9a3}
\begin{itemize}
\item no bootstrap, no jquery
\item setup proper layouts for the GUI
\item discussed how we want to handle events onclick
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:orgb7c4d97}
\begin{itemize}
\item push scaffolds for the website GUI
\item handle basic logic for pushing items to back-end storage
\item create mock of Rust functionality in TypeScript for further discussion
\end{itemize}
\subsection{Meeting 2019.10.05}
\label{sec:org7df7d27}
\begin{itemize}
\item Duration: 1 Hour, 16 Minutes
\item Location: Video Call
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org02934fe}
\begin{itemize}
\item CSS Grid
\item SASS
\item TypeScript
\item build script compilation and runtime
\item proper layout for GUI
\end{itemize}
\subsubsection*{CSS Grid}
\label{sec:org57298d1}
\begin{itemize}
\item teach Michael about CSS Grid
\item pure CSS, not bootstrap (Elias)
\item use columns properly
\item no need for floats / flexbox
\end{itemize}
\subsubsection*{SASS}
\label{sec:org845a42e}
\begin{itemize}
\item transpiler for CSS
\item allows nested functionality
\item separate compiled/uncompiled folders
\item use \texttt{watch} script to sync changes
\end{itemize}
\subsubsection*{TypeScript}
\label{sec:org42a5b66}
\begin{itemize}
\item better able to handle equivalence mocking to Rust
\item easy to push onto browser
\item separate folders (see above)
\item push to public folder for site access
\end{itemize}
\subsubsection*{Build Script Compilation and Runtime}
\label{sec:orga8b2fb9}
\begin{itemize}
\item use watch and start scripts to build site
\item separate scripts will be run for Rust beforehand
\item build scripts allow for synced changes between folders (see above)
\end{itemize}
\subsubsection*{Proper Layout for GUI}
\label{sec:orgb5b80e8}
\begin{itemize}
\item use column areas in CSS Grid
\item main column for game
\item nested grid for board layout (tentative)
\item proportion text for board side-by-side
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org9dd1ffe}
\begin{itemize}
\item design docs
\item microcharter
\item mocking TS => Rust
\item event keys on front-end (browser)
\end{itemize}
\subsection{Meeting 2019.10.06}
\label{sec:org278fcd4}
\begin{itemize}
\item Duration: 7 hours
\item Location: Video Call
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org1188fea}
\begin{itemize}
\item Tying up loose ends with respect to documentation and write up
\item Tying up loose ends with respect to UI/JS end of the application
\item Discussing what is left to do with the project
\end{itemize}
\subsubsection*{Documentation and Write-up}
\label{sec:orgf5e93e3}
\begin{itemize}
\item Figured out how to format the tables given that many of the ones provided do not play well
with latex/org-mode markdown
\item Similarly, decided on how to interconnect documentation components between sections
\item Discussed the remaining things left undocumented, particularly pair ratings.
\end{itemize}
\subsubsection*{UI/JS Loose Ends}
\label{sec:org594780d}
\begin{itemize}
\item Complete manual testing of interacting elements
\item Finalize positions of clickable elements on the board grid.
\item Alternating player logic for placement of pieces.
\item Limiting piece placement to nine.
\end{itemize}
\subsubsection*{Discussing Future Sprint/Direction of Project}
\label{sec:orgdd28e0b}
\begin{itemize}
\item Current User Stories are pseudo-Epics and need to be refined into better User stories aside
from \hyperref[sec:org67174d3]{S1}. As they stand, discussing the current user stories makes for overly generic/abstract
discussion and doesn't meaningfully translate into logic/behavior to implement and actual
engineering tasks.
\item Currently, the front end mocks all of the behavior/functionality that would otherwise be
provided by the backend. In sprint 2, this is where the real meat of programming will come in
as we learn to make the back-end and front-end interface, particularly with translating data
types across the FFI boundary through Neon.
\item We need to improve the current state documentation massively.
\begin{itemize}
\item Design diagrams.
\item Docstrings across software code base.
\item Event diagrams.
\end{itemize}
\item Translate the above issues into their proper documentation for the master documentation and
write-up file
\item How to test more of the functionality given that a major component of this application is
running directly on the browser.
\end{itemize}
\subsection{Meeting 2019.10.11}
\label{sec:orgbfc100d}
\begin{itemize}
\item Duration: 2 hour
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org8aa37d4}
\begin{itemize}
\item review sprint 1
\begin{itemize}
\item bugs
\end{itemize}
\item roadmap sprint 2
\begin{itemize}
\item outline what is needed
\item setup project board
\item issues
\item interface between front/end
\end{itemize}
\end{itemize}
