doc/sprint2_writeup.org
*** Review of Sprint 1
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - GUI
      + coordinate system
      + testing was not fun w/ current setup
    - backend
      + types, not much else
    - documentation
      + implemented a decent workflow for putting together and compiling a documentation artifact
        for submission
    - complains
      + mostly just not having enough meetings despite getting 6 of them in before deadline.
        * had one right before submission, was clearly heavily crunch oriented.
        * documentation was a major pain point given the ratio of code/work to actual required
          documentation.
*** Sprint 2 Roadmap 
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
**** bugs
     - Wrong current player display
     - Bad formatting of org mode files on GH
       + won't fix bc final artifact pdf, that looks fine
     - Bad formatting of code inputs/outputs on manual tests within tables as currently.
**** submission requirements of Sprint 2
     - full human player vs human player functionality
       + piece movement
       + piece elimination
       + mill formation
       + (optional) piece flying
       + end game
     - All proper documentation wrt to above new functionality and its implementation
       + User story refinements
         * side note: this is actually more sizeable then what it appears
       + AC and respective refinements
         * at least one manual *or* automatic
       + all test code and documentation
         * aside from manual/automatic requirements, all units of code should have a accompanying
           unit test.
**** project board (backlog/requirement refinement)
     1. Front End -> Backend communication
        - JS speaks to rust
          + Struct will have a position struct and an event enum that dictates to backend what to
            do next.
          + let's call this object a =PushEventStruct=
          + This represents the attempted inputs/moves of the current player
     2. Backend -> Front end communication
        - backend runs actual logic and validation
        - upon receiving a =PushEventStruct=, the back-end:
          1. Does a validation:
             - Checks whether requested action is valid in the current game state
             - When not valid, immediate returns:
               1. Original =BoardStruct=
               2. =InputHandle= -> Error that rust handles, and returns "none" to JS
               3. =Trigger= dependent on game state transition
          2. Game Manager handles event:
             - Processes game events and generates resulting new game state
          3. Back-end returns new =State=, where:
             - =InputHandle= is =Success=
             - =BoardStruct= is the new =State=
             - =Trigger= of the condition of the phase is satisfied
               + =none=
               + =elimination=
               + =flying=
               + =gameover=
     3. Proper GUI styling
        - Add Game meta information
          + how many pieces left for each player
          + current phase (turn)
          + (optional/idea) GUI indicates existing mills
        - game menu
          + theme options
          + game options
          + how to play
        - mobile/responsive design
**** snow plow form sprint 1
     1. design docs
     2. Development Workflow
        - CI/CD with GitHub Actions
          + CI
            * need front-end GH Action
            * need back-end GH Action
            * figure out action for integration between front/back components
        - Development environment documentation
          + How to setup local machine to build both the front and back-end
** Meeting 2019.10.25
   - Duration: 2 hours
   - Location: Miller Nichols Library
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - new project format
    - testing
      + server
      + gui
      + unit testing
    - interop/ffi/interfaces
      + managerGlue
    - general development/programming
*** Project Format
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - rust projects using neon have a default layout
      + not friendly for testing the rust specific code
      + similarly, not friendly for testing the node/js/front-end code not involved with rust
        exported module
    - solution: rust workspaces
      + simply change top level to have cargo file with workspace member declarations
      + well documented here: https://github.com/neon-bindings/examples/tree/master/workspace
    - benefits:
      + can now run rust tests independent of node/js via traditional ~cargo test~ and ~cargo check~
      + furthermore, now have backend code organized as:
        #+begin_verse
        .
         Cargo.lock
         Cargo.toml
         lib
          index.js
         native
             artifacts.json
             base
              Cargo.toml
              src
             build.rs
             Cargo.toml
             index.node
             src
              lib.rs
             target
        #+end_verse
      + This allows us to move all logic into a sub-crate, =base=, which is private and internal to
         the backend. An API for the module that provides the backend functionality is the only thing
         exposed in the main ~native/src/lib.rs~ file, which is what is compiled and exported to node.
        - i.e. we keep our code enapsulated and enforce demeter's law
      + finally, means all integrations tests on node side only test the actual interopability logic
        and functionality rather than any of the rust specific code and logic.
*** Testing
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - ibid project format for overall structure's effect on testing approach
    - server (node):
      + no browser tests
      + check if all functions are translated properly
        * node functions get translated to plaintext js functions
      + request testing
        * extra assets (GET stuff)
        * further research/parking lot:
          - coop and multiple clients
    - gui (client stuff):
      + test functions within test module:
        * master functions that assert all tests at instantiation
        * i.e. when browser pulls the plain js
        * pull from dev endpoint
      + manual testing:
        * automated testing on browser is pretty bad/gross
        * getting setup not really worth it, so opting for manual tests as necessary.
      + three layer testing (~eventPress~):
        * log input events from divs
        * validation testing on newly retrieved ~BoardState~
    - unit testing:
      + *reminder*: 1:1 ratio between functions and tests at minimum, 2:3 ideally
      + rust is pretty straight forward, built in as first class feature.
        * managerGlue
          - dedicated interop testing
          - mutation of state from rust
          - this is probably going to mocking
