doc/sprint2_writeup.tex
\subsubsection*{Review of Sprint 1}
\label{sec:org7d640a7}
\begin{itemize}
\item GUI
\begin{itemize}
\item coordinate system
\item testing was not fun w/ current setup
\end{itemize}
\item backend
\begin{itemize}
\item types, not much else
\end{itemize}
\item documentation
\begin{itemize}
\item implemented a decent workflow for putting together and compiling a documentation artifact
for submission
\end{itemize}
\item complains
\begin{itemize}
\item mostly just not having enough meetings despite getting 6 of them in before deadline.
\begin{itemize}
\item had one right before submission, was clearly heavily crunch oriented.
\item documentation was a major pain point given the ratio of code/work to actual required
documentation.
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection*{Sprint 2 Roadmap}
\label{sec:org0a103e4}
\begin{itemize}
\item bugs
\label{sec:org8059d8c}
\begin{itemize}
\item Wrong current player display
\item Bad formatting of org mode files on GH
\begin{itemize}
\item won't fix bc final artifact pdf, that looks fine
\end{itemize}
\item Bad formatting of code inputs/outputs on manual tests within tables as currently.
\end{itemize}
\item submission requirements of Sprint 2
\label{sec:org3b189fe}
\begin{itemize}
\item full human player vs human player functionality
\begin{itemize}
\item piece movement
\item piece elimination
\item mill formation
\item (optional) piece flying
\item end game
\end{itemize}
\item All proper documentation wrt to above new functionality and its implementation
\begin{itemize}
\item User story refinements
\begin{itemize}
\item side note: this is actually more sizeable then what it appears
\end{itemize}
\item AC and respective refinements
\begin{itemize}
\item at least one manual \textbf{or} automatic
\end{itemize}
\item all test code and documentation
\begin{itemize}
\item aside from manual/automatic requirements, all units of code should have a accompanying
unit test.
\end{itemize}
\end{itemize}
\end{itemize}
\item project board (backlog/requirement refinement)
\label{sec:org5cfdd9a}
\begin{enumerate}
\item Front End -> Backend communication
\begin{itemize}
\item JS speaks to rust
\begin{itemize}
\item Struct will have a position struct and an event enum that dictates to backend what to
do next.
\item let's call this object a \texttt{PushEventStruct}
\item This represents the attempted inputs/moves of the current player
\end{itemize}
\end{itemize}
\item Backend -> Front end communication
\begin{itemize}
\item backend runs actual logic and validation
\item upon receiving a \texttt{PushEventStruct}, the back-end:
\begin{enumerate}
\item Does a validation:
\begin{itemize}
\item Checks whether requested action is valid in the current game state
\item When not valid, immediate returns:
\begin{enumerate}
\item Original \texttt{BoardStruct}
\item \texttt{InputHandle} -> Error that rust handles, and returns "none" to JS
\item \texttt{Trigger} dependent on game state transition
\end{enumerate}
\end{itemize}
\item Game Manager handles event:
\begin{itemize}
\item Processes game events and generates resulting new game state
\end{itemize}
\item Back-end returns new \texttt{State}, where:
\begin{itemize}
\item \texttt{InputHandle} is \texttt{Success}
\item \texttt{BoardStruct} is the new \texttt{State}
\item \texttt{Trigger} of the condition of the phase is satisfied
\begin{itemize}
\item \texttt{none}
\item \texttt{elimination}
\item \texttt{flying}
\item \texttt{gameover}
\end{itemize}
\end{itemize}
\end{enumerate}
\end{itemize}
\item Proper GUI styling
\begin{itemize}
\item Add Game meta information
\begin{itemize}
\item how many pieces left for each player
\item current phase (turn)
\item (optional/idea) GUI indicates existing mills
\end{itemize}
\item game menu
\begin{itemize}
\item theme options
\item game options
\item how to play
\end{itemize}
\item mobile/responsive design
\end{itemize}
\end{enumerate}
\item snow plow form sprint 1
\label{sec:org792d259}
\begin{enumerate}
\item design docs
\item Development Workflow
\begin{itemize}
\item CI/CD with GitHub Actions
\begin{itemize}
\item CI
\begin{itemize}
\item need front-end GH Action
\item need back-end GH Action
\item figure out action for integration between front/back components
\end{itemize}
\end{itemize}
\item Development environment documentation
\begin{itemize}
\item How to setup local machine to build both the front and back-end
\end{itemize}
\end{itemize}
\end{enumerate}
\end{itemize}
\subsection{Meeting 2019.10.25}
\label{sec:org75e5ab8}
\begin{itemize}
\item Duration: 2 hours
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org319cf63}
\begin{itemize}
\item new project format
\item testing
\begin{itemize}
\item server
\item gui
\item unit testing
\end{itemize}
\item interop/ffi/interfaces
\begin{itemize}
\item managerGlue
\end{itemize}
\item general development/programming
\end{itemize}
\subsubsection*{Project Format}
\label{sec:orgd08f550}
\begin{itemize}
\item rust projects using neon have a default layout
\begin{itemize}
\item not friendly for testing the rust specific code
\item similarly, not friendly for testing the node/js/front-end code not involved with rust
exported module
\end{itemize}
\item solution: rust workspaces
\begin{itemize}
\item simply change top level to have cargo file with workspace member declarations
\item well documented here: \url{https://github.com/neon-bindings/examples/tree/master/workspace}
\end{itemize}
\item benefits:
\begin{itemize}
\item can now run rust tests independent of node/js via traditional \texttt{cargo test} and \texttt{cargo check}
\item furthermore, now have backend code organized as:
\begin{verse}
.\\
 Cargo.lock\\
 Cargo.toml\\
 lib\\
  index.js\\
 native\\
\hspace*{4em} artifacts.json\\
\hspace*{4em} base\\
\hspace*{4em}  Cargo.toml\\
\hspace*{4em}  src\\
\hspace*{4em} build.rs\\
\hspace*{4em} Cargo.toml\\
\hspace*{4em} index.node\\
\hspace*{4em} src\\
\hspace*{4em}  lib.rs\\
\hspace*{4em} target\\
\end{verse}
\item This allows us to move all logic into a sub-crate, \texttt{base}, which is private and internal to
the backend. An API for the module that provides the backend functionality is the only thing
exposed in the main \texttt{native/src/lib.rs} file, which is what is compiled and exported to node.
\begin{itemize}
\item i.e. we keep our code enapsulated and enforce demeter's law
\end{itemize}
\item finally, means all integrations tests on node side only test the actual interopability logic
and functionality rather than any of the rust specific code and logic.
\end{itemize}
\end{itemize}
\subsubsection*{Testing}
\label{sec:orgd9080dd}
\begin{itemize}
\item ibid project format for overall structure's effect on testing approach
\item server (node):
\begin{itemize}
\item no browser tests
\item check if all functions are translated properly
\begin{itemize}
\item node functions get translated to plaintext js functions
\end{itemize}
\item request testing
\begin{itemize}
\item extra assets (GET stuff)
\item further research/parking lot:
\begin{itemize}
\item coop and multiple clients
\end{itemize}
\end{itemize}
\end{itemize}
\item gui (client stuff):
\begin{itemize}
\item test functions within test module:
\begin{itemize}
\item master functions that assert all tests at instantiation
\item i.e. when browser pulls the plain js
\item pull from dev endpoint
\end{itemize}
\item manual testing:
\begin{itemize}
\item automated testing on browser is pretty bad/gross
\item getting setup not really worth it, so opting for manual tests as necessary.
\end{itemize}
\item three layer testing (\texttt{eventPress}):
\begin{itemize}
\item log input events from divs
\item validation testing on newly retrieved \texttt{BoardState}
\end{itemize}
\end{itemize}
\item unit testing:
\begin{itemize}
\item \textbf{reminder}: 1:1 ratio between functions and tests at minimum, 2:3 ideally
\item rust is pretty straight forward, built in as first class feature.
\begin{itemize}
\item managerGlue
\begin{itemize}
\item dedicated interop testing
\item mutation of state from rust
\item this is probably going to mocking
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}
