doc/sprint2_writeup.org
*** Interop/FFI/Interface
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - rust -> neon -> index.node -> yields an array of exports, i.e. ~register_module!~
    - managerGlue
      + pulls rust functions into script source, i.e. require
      + completely server side
      + browser does not support at current level
        * node has a virtual dom representation that browsers simply don't support
        * this is why node gets trans to strings, saved as asset/js,  and pulled into browser
*** TODO action items
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - refine user stories generally
      + currently are epic-y, need to be more specific and decomposable
    - Generate acceptance criterions from new refinements + issues discussed in today's meeting
      + add as items to issues/sprint 2 board on GH
** Meeting 2019.11.01
   - duration: 2 hours
   - Location: Miller Nichols Library
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - updates on back-end
     - discuss change of server structure
     - code review
     - refinement user stories
     - refinement acceptance criteria
     - matching browser to server requirements
*** Back-end Updates
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - made a [[https://github.com/amadeusine/CS449GroupProject/issues/22][tracking issue]] on GH for all requirements of sprint2 with respect to back-end
    - consists of multiple tasks derived from acceptance criterion and user story relevant to
      game board
      + #23: align back-end types with front-end types due to requirement changes (DONE)
      + #28: add file reader utility (DONE)
      + #24: exporting rust types to js equivs (Nearly done)
      + #25: importing js types to rust equivs (TODO)
      + #26: game validation logic (#)
    - *NOTE about game movement*
      * No longer have PieceSwitch/PieceMove enums.
      * Instead, option will yield a player and a position
      * backend will know from gamestate whether this is a piece moving OUT or INTO a position
      * will check accordingly
*** Server Structure Changes
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Four changes coming out:
      1. break out static files from server
         - tightly coupled with server currently
         - as if local app
      2. adding 3 endpoints for:
         - logic
         - theme
         - setup: (reach stuff for sprint3)
      3. new structures and classes (issue #31)
         - client connection class
           + browser & networking validation
           + putting in place design necessary to allow program to be extended to client-client
             interactions
           + separation of game and web-server
         - onclick request (Browser side)
           + setup structure for binding between browser and server, 1:1
           + each event calls back to browser's main function for getRequest
             * send off payload to server, which sends to rust module export
         - browser needs its own board manager, separate from ManagerGlue
           + allows for state to be accepted on browser side
         - BoardReceptor (server)
           + scaffold for endpoint components
           + allows browser to hit endpoints/communicate with server
*** Code Review
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - documented in sprint2_writeup.org
*** Matching Browser-Server Reqs
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Reference: server structure changes list item 3
    - triggers are sent from server to browser
      + new components are entered on display
        * menu item
        * removal of input during player's turn, on opponent
        * game over
        * restart
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - refinement (grooming) of US, AC, and tasks.
** Meeting 2019.11.02
   - Duration: 2 hour
   - Location: Voice Chat
*** Agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
 - refactor server templating
 - add endpoints
 - revise UI
*** Refactor Server Templating
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - board grid elements can be iterated
     - colors can be templated
     - tests can be separated
     - scripts can be separated
*** Add Endpoints
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - see last meeting (endpoint list)
     - logic receives payload, returns native response
     - BoardReceptor now implied, soon to be implemented (sprint #3)
     - error component templates on bad payload
*** Revise UI
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - Figma for design mockups
     - Get menu bar up and running (Michael)
     - Reconfigure game site layout
     - information page?
*** TODO
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
     - add final endpoints for talkback
     - browser's `Window`/`Board` needs HTTP adhesion to server
     - design reconfiguration
** Meeting 2019.11.03
   - Duration: 7 hour
   - Location: Voice Chat
*** agenda
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Blitzing remaining issues
    - Blitzing documentation
*** Remaining Issues
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Mocking final game logic with typescript
    - Adding tests
    - Definition of Done: Hit all story points that have been listed thus far.
*** Blitzing Documentation
    :PROPERTIES:
    :UNNUMBERED: t
    :END:
    - Updating all tables
    - Fixing formatting on code review tables
    - Adding new meeting minutes
* Team Ratings
  :PROPERTIES:
  :CUSTOM_ID: S7
  :END:
  Submission document does not specify scale, so it is assumed out of 5 with 1 being "Worst" and 5
  being "Excellent".

  #+ATTR_LaTeX: :align |c|c|c|c|
  |---------------------------+---------------------------+---------------+---------------------|
  |                           | Elias Julian Marko Garcia | Michael Sy Cu | Samuel Chia Ern Lim |
  |---------------------------+---------------------------+---------------+---------------------|
  | Elias Julian Marko Garcia |                         - |             5 |                   5 |
  |---------------------------+---------------------------+---------------+---------------------|
  | Michael Sy Cu             |                         5 |             - |                   5 |
  |---------------------------+---------------------------+---------------+---------------------|
  | Samuel Chia Ern           |                         5 |             5 |                   - |
  |---------------------------+---------------------------+---------------+---------------------|
  | Average                   |                         5 |             5 |                   5 |
  |---------------------------+---------------------------+---------------+---------------------|


