doc/sprint2_writeup.tex
\subsubsection*{Interop/FFI/Interface}
\label{sec:org0fb2957}
\begin{itemize}
\item rust -> neon -> index.node -> yields an array of exports, i.e. \texttt{register\_module!}
\item managerGlue
\begin{itemize}
\item pulls rust functions into script source, i.e. require
\item completely server side
\item browser does not support at current level
\begin{itemize}
\item node has a virtual dom representation that browsers simply don't support
\item this is why node gets trans to strings, saved as asset/js,  and pulled into browser
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} action items}
\label{sec:orgdc32f38}
\begin{itemize}
\item refine user stories generally
\begin{itemize}
\item currently are epic-y, need to be more specific and decomposable
\end{itemize}
\item Generate acceptance criterions from new refinements + issues discussed in today's meeting
\begin{itemize}
\item add as items to issues/sprint 2 board on GH
\end{itemize}
\end{itemize}
\subsection{Meeting 2019.11.01}
\label{sec:org24a2553}
\begin{itemize}
\item duration: 2 hours
\item Location: Miller Nichols Library
\end{itemize}
\subsubsection*{Agenda}
\label{sec:org24068ae}
\begin{itemize}
\item updates on back-end
\item discuss change of server structure
\item code review
\item refinement user stories
\item refinement acceptance criteria
\item matching browser to server requirements
\end{itemize}
\subsubsection*{Back-end Updates}
\label{sec:org5486be6}
\begin{itemize}
\item made a \href{https://github.com/amadeusine/CS449GroupProject/issues/22}{tracking issue} on GH for all requirements of sprint2 with respect to back-end
\item consists of multiple tasks derived from acceptance criterion and user story relevant to
game board
\begin{itemize}
\item \#23: align back-end types with front-end types due to requirement changes (DONE)
\item \#28: add file reader utility (DONE)
\item \#24: exporting rust types to js equivs (Nearly done)
\item \#25: importing js types to rust equivs (TODO)
\item \#26: game validation logic (\#)
\end{itemize}
\item \textbf{NOTE about game movement}
\begin{itemize}
\item No longer have PieceSwitch/PieceMove enums.
\item Instead, option will yield a player and a position
\item backend will know from gamestate whether this is a piece moving OUT or INTO a position
\item will check accordingly
\end{itemize}
\end{itemize}
\subsubsection*{Server Structure Changes}
\label{sec:orgde6c4b3}
\begin{itemize}
\item Four changes coming out:
\begin{enumerate}
\item break out static files from server
\begin{itemize}
\item tightly coupled with server currently
\item as if local app
\end{itemize}
\item adding 3 endpoints for:
\begin{itemize}
\item logic
\item theme
\item setup: (reach stuff for sprint3)
\end{itemize}
\item new structures and classes (issue \#31)
\begin{itemize}
\item client connection class
\begin{itemize}
\item browser \& networking validation
\item putting in place design necessary to allow program to be extended to client-client
interactions
\item separation of game and web-server
\end{itemize}
\item onclick request (Browser side)
\begin{itemize}
\item setup structure for binding between browser and server, 1:1
\item each event calls back to browser's main function for getRequest
\begin{itemize}
\item send off payload to server, which sends to rust module export
\end{itemize}
\end{itemize}
\item browser needs its own board manager, separate from ManagerGlue
\begin{itemize}
\item allows for state to be accepted on browser side
\end{itemize}
\item BoardReceptor (server)
\begin{itemize}
\item scaffold for endpoint components
\item allows browser to hit endpoints/communicate with server
\end{itemize}
\end{itemize}
\end{enumerate}
\end{itemize}
\subsubsection*{Code Review}
\label{sec:orgd6677d6}
\begin{itemize}
\item documented in sprint2\(_{\text{writeup.org}}\)
\end{itemize}
\subsubsection*{Matching Browser-Server Reqs}
\label{sec:orgf8c53a5}
\begin{itemize}
\item Reference: server structure changes list item 3
\item triggers are sent from server to browser
\begin{itemize}
\item new components are entered on display
\begin{itemize}
\item menu item
\item removal of input during player's turn, on opponent
\item game over
\item restart
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org66e5f1d}
\begin{itemize}
\item refinement (grooming) of US, AC, and tasks.
\end{itemize}
\subsection{Meeting 2019.11.02}
\label{sec:org126865b}
\begin{itemize}
\item Duration: 2 hour
\item Location: Voice Chat
\end{itemize}
\subsubsection*{Agenda}
\label{sec:orgb03c376}
\begin{itemize}
\item refactor server templating
\item add endpoints
\item revise UI
\end{itemize}
\subsubsection*{Refactor Server Templating}
\label{sec:orgc9e8be1}
\begin{itemize}
\item board grid elements can be iterated
\item colors can be templated
\item tests can be separated
\item scripts can be separated
\end{itemize}
\subsubsection*{Add Endpoints}
\label{sec:orga53a191}
\begin{itemize}
\item see last meeting (endpoint list)
\item logic receives payload, returns native response
\item BoardReceptor now implied, soon to be implemented (sprint \#3)
\item error component templates on bad payload
\end{itemize}
\subsubsection*{Revise UI}
\label{sec:org09d9922}
\begin{itemize}
\item Figma for design mockups
\item Get menu bar up and running (Michael)
\item Reconfigure game site layout
\item information page?
\end{itemize}
\subsubsection*{{\bfseries\sffamily TODO} }
\label{sec:org96d2a8f}
\begin{itemize}
\item add final endpoints for talkback
\item browser's `Window`/`Board` needs HTTP adhesion to server
\item design reconfiguration
\end{itemize}
\subsection{Meeting 2019.11.03}
\label{sec:orgdf23a73}
\begin{itemize}
\item Duration: 7 hour
\item Location: Voice Chat
\end{itemize}
\subsubsection*{agenda}
\label{sec:orge3a07b3}
\begin{itemize}
\item Blitzing remaining issues
\item Blitzing documentation
\end{itemize}
\subsubsection*{Remaining Issues}
\label{sec:orga7f0f2d}
\begin{itemize}
\item Mocking final game logic with typescript
\item Adding tests
\item Definition of Done: Hit all story points that have been listed thus far.
\end{itemize}
\subsubsection*{Blitzing Documentation}
\label{sec:orgfdfc65b}
\begin{itemize}
\item Updating all tables
\item Fixing formatting on code review tables
\item Adding new meeting minutes
\end{itemize}
\section{Team Ratings}
\label{sec:orgda8dd33}
Submission document does not specify scale, so it is assumed out of 5 with 1 being "Worst" and 5
being "Excellent".

\begin{center}
\begin{tabular}{|c|c|c|c|}
\hline
 & Elias Julian Marko Garcia & Michael Sy Cu & Samuel Chia Ern Lim\\
\hline
Elias Julian Marko Garcia & - & 5 & 5\\
\hline
Michael Sy Cu & 5 & - & 5\\
\hline
Samuel Chia Ern & 5 & 5 & -\\
\hline
Average & 5 & 5 & 5\\
\hline
\end{tabular}
\end{center}
\end{document}